Terraform will perform the following actions:

  # module.aws.aws_s3_bucket.chat will be updated in-place
  ~ resource "aws_s3_bucket" "chat" {
      + force_destroy               = false
        id                          = "tl-public-chat-mw-stg"
        tags                        = {}
        # (9 unchanged attributes hidden)

      - timeouts {}

        # (4 unchanged blocks hidden)
    }

  # module.aws.aws_s3_bucket.docs will be updated in-place
  ~ resource "aws_s3_bucket" "docs" {
      + force_destroy               = false
        id                          = "tl-aselo-docs-mw-staging"
        tags                        = {}
        # (9 unchanged attributes hidden)

      - timeouts {}

        # (4 unchanged blocks hidden)
    }

  # module.aws.aws_s3_bucket_cors_configuration.chat will be created
  + resource "aws_s3_bucket_cors_configuration" "chat" {
      + bucket = "tl-public-chat-mw-stg"
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "GET",
              + "POST",
              + "PUT",
            ]
          + allowed_origins = [
              + "https://flex.twilio.com",
            ]
          + expose_headers  = []
        }
    }

  # module.aws.aws_s3_bucket_cors_configuration.docs will be created
  + resource "aws_s3_bucket_cors_configuration" "docs" {
      + bucket = "tl-aselo-docs-mw-staging"
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "GET",
              + "POST",
              + "PUT",
            ]
          + allowed_origins = [
              + "https://flex.twilio.com",
            ]
          + expose_headers  = []
        }
    }

  # module.aws.aws_s3_bucket_lifecycle_configuration.hrm_export_expiry will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "hrm_export_expiry" {
      + bucket = "tl-aselo-docs-mw-staging"
      + id     = (known after apply)

      + rule {
          + id     = "HRM Exported Data Expiration Policy"
          + status = "Enabled"

          + expiration {
              + days                         = 30
              + expired_object_delete_marker = (known after apply)
            }

          + filter {
              + prefix = "hrm-data/"
            }
        }
    }

  # module.aws.aws_s3_bucket_ownership_controls.chat will be created
  + resource "aws_s3_bucket_ownership_controls" "chat" {
      + bucket = "tl-public-chat-mw-stg"
      + id     = (known after apply)

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # module.aws.aws_s3_bucket_ownership_controls.docs will be created
  + resource "aws_s3_bucket_ownership_controls" "docs" {
      + bucket = "tl-aselo-docs-mw-staging"
      + id     = (known after apply)

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # module.aws.aws_s3_bucket_public_access_block.chat will be created
  + resource "aws_s3_bucket_public_access_block" "chat" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = "tl-public-chat-mw-stg"
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # module.aws.aws_s3_bucket_public_access_block.docs will be created
  + resource "aws_s3_bucket_public_access_block" "docs" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "tl-aselo-docs-mw-staging"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.aws.aws_s3_bucket_server_side_encryption_configuration.chat will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "chat" {
      + bucket = "tl-public-chat-mw-stg"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.aws.aws_s3_bucket_server_side_encryption_configuration.docs will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "docs" {
      + bucket = "tl-aselo-docs-mw-staging"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.aws.aws_ssm_parameter.aws_region will be created
  + resource "aws_ssm_parameter" "aws_region" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - account SID by short helpline"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/staging/aws/AC874af45ec4a696d5d4dca07b0036e2bf/region"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "/staging/aws/AC874af45ec4a696d5d4dca07b0036e2bf/region"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "staging"
          + "Name"        = "/staging/aws/AC874af45ec4a696d5d4dca07b0036e2bf/region"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.datadog_access_token will be created
  + resource "aws_ssm_parameter" "datadog_access_token" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Datadog - Access Token"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/staging/datadog/AC874af45ec4a696d5d4dca07b0036e2bf/access_token"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "/staging/datadog/AC874af45ec4a696d5d4dca07b0036e2bf/access_token"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "staging"
          + "Name"        = "/staging/datadog/AC874af45ec4a696d5d4dca07b0036e2bf/access_token"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.datadog_app_id will be created
  + resource "aws_ssm_parameter" "datadog_app_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Datadog - Application ID"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/staging/datadog/AC874af45ec4a696d5d4dca07b0036e2bf/app_id"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "/staging/datadog/AC874af45ec4a696d5d4dca07b0036e2bf/app_id"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "staging"
          + "Name"        = "/staging/datadog/AC874af45ec4a696d5d4dca07b0036e2bf/app_id"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.main_group["ACCESS_TOKEN"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
      + description = (sensitive value)
        id          = "STG_DATADOG_MW_ACCESS_TOKEN"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ name        = (sensitive value)
        tags        = {}
        # (8 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["APP_ID"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
      + description = (sensitive value)
        id          = "STG_DATADOG_MW_APP_ID"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ name        = (sensitive value)
        tags        = {}
        # (8 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["CHAT_SERVICE_SID"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
      ~ description = "Staging - Tithandizane Helpline Twilio account - Chat service SID" -> "Twilio account - Chat service SID"
        id          = "STG_TWILIO_MW_CHAT_SERVICE_SID"
        name        = "STG_TWILIO_MW_CHAT_SERVICE_SID"
      ~ tags        = {
          - "Environment" = "Staging" -> null
          - "Helpline"    = "Tithandizane Helpline" -> null
        }
      ~ tags_all    = {
          - "Environment" = "Staging"
          - "Helpline"    = "Tithandizane Helpline"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["CHAT_WORKFLOW_SID"] must be replaced
-/+ resource "aws_ssm_parameter" "main_group" {
      ~ arn            = "arn:aws:ssm:us-east-1:712893914485:parameter/STG_TWILIO_MW_CHAT_WORKFLOW_SID" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ description    = "Staging - Tithandizane Helpline Twilio account - Chat transfer workflow SID" -> (known after apply)
      ~ id             = "STG_TWILIO_MW_CHAT_WORKFLOW_SID" -> (known after apply)
      + insecure_value = (known after apply)
      ~ key_id         = "alias/aws/ssm" -> (known after apply)
      ~ name           = "STG_TWILIO_MW_CHAT_WORKFLOW_SID" # forces replacement -> (known after apply) # forces replacement
      - tags           = {
          - "Environment" = "Staging"
          - "Helpline"    = "Tithandizane Helpline"
        } -> null
      ~ tags_all       = {
          - "Environment" = "Staging"
          - "Helpline"    = "Tithandizane Helpline"
        } -> (known after apply)
      ~ tier           = "Standard" -> (known after apply)
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["FLEX_PROXY_SERVICE_SID"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
      + description = "Twilio account - Flex Proxy service SID"
        id          = "STG_TWILIO_MW_FLEX_PROXY_SERVICE_SID"
        name        = "STG_TWILIO_MW_FLEX_PROXY_SERVICE_SID"
        tags        = {}
        # (8 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["OPERATING_INFO_KEY"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
      + description    = "Twilio account - Operating Key info"
        id             = "STG_TWILIO_MW_OPERATING_INFO_KEY"
      + insecure_value = (known after apply)
        name           = "STG_TWILIO_MW_OPERATING_INFO_KEY"
        tags           = {}
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["S3_BUCKET_DOCS"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
      ~ description = "Staging - XXXXXXXXXXXXXXXXXX Twilio account - S3 Bucket for storing documents" -> "Twilio account - Post Survey bot chat url"
        id          = "STG_TWILIO_MW_S3_BUCKET_DOCS"
        name        = "STG_TWILIO_MW_S3_BUCKET_DOCS"
      ~ tags        = {
          - "Environment" = "Staging" -> null
          - "Helpline"    = "XXXXXXXXXXXXXXXXXX" -> null
        }
      ~ tags_all    = {
          - "Environment" = "Staging"
          - "Helpline"    = "XXXXXXXXXXXXXXXXXX"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["SURVEY_WORKFLOW_SID"] must be replaced
-/+ resource "aws_ssm_parameter" "main_group" {
      ~ arn            = "arn:aws:ssm:us-east-1:712893914485:parameter/STG_TWILIO_MW_SURVEY_WORKFLOW_SID" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      + description    = (known after apply)
      ~ id             = "STG_TWILIO_MW_SURVEY_WORKFLOW_SID" -> (known after apply)
      + insecure_value = (known after apply)
      ~ key_id         = "alias/aws/ssm" -> (known after apply)
      ~ name           = "STG_TWILIO_MW_SURVEY_WORKFLOW_SID" # forces replacement -> (known after apply) # forces replacement
      - tags           = {} -> null
      ~ tags_all       = {} -> (known after apply)
      ~ tier           = "Standard" -> (known after apply)
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["SYNC_SID"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
      ~ description = "Staging - Tithandizane Helpline Twilio account - Sync service SID" -> "Twilio account - Sync service "
        id          = "STG_TWILIO_MW_SYNC_SID"
        name        = "STG_TWILIO_MW_SYNC_SID"
      ~ tags        = {
          - "Environment" = "Staging" -> null
          - "Helpline"    = "Tithandizane Helpline" -> null
        }
      ~ tags_all    = {
          - "Environment" = "Staging"
          - "Helpline"    = "Tithandizane Helpline"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["WORKSPACE_SID"] will be updated in-place
  ~ resource "aws_ssm_parameter" "main_group" {
      ~ description = "Staging - Tithandizane Helpline Twilio account - Workspace SID" -> "Twilio account - Workspace SID"
        id          = "STG_TWILIO_MW_WORKSPACE_SID"
        name        = "STG_TWILIO_MW_WORKSPACE_SID"
      ~ tags        = {
          - "Environment" = "Staging" -> null
          - "Helpline"    = "Tithandizane Helpline" -> null
        }
      ~ tags_all    = {
          - "Environment" = "Staging"
          - "Helpline"    = "Tithandizane Helpline"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.s3_docs_bucket_id will be created
  + resource "aws_ssm_parameter" "s3_docs_bucket_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "S3 - Docs bucket name"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/staging/s3/AC874af45ec4a696d5d4dca07b0036e2bf/docs_bucket_name"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "/staging/s3/AC874af45ec4a696d5d4dca07b0036e2bf/docs_bucket_name"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "staging"
          + "Name"        = "/staging/s3/AC874af45ec4a696d5d4dca07b0036e2bf/docs_bucket_name"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.serverless_base_url will be created
  + resource "aws_ssm_parameter" "serverless_base_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Serverless - Base URL"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/staging/serverless/AC874af45ec4a696d5d4dca07b0036e2bf/base_url"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "/staging/serverless/AC874af45ec4a696d5d4dca07b0036e2bf/base_url"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "staging"
          + "Name"        = "/staging/serverless/AC874af45ec4a696d5d4dca07b0036e2bf/base_url"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_auth_token will be created
  + resource "aws_ssm_parameter" "twilio_auth_token" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Auth Token"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/staging/twilio/AC874af45ec4a696d5d4dca07b0036e2bf/auth_token"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/AC874af45ec4a696d5d4dca07b0036e2bf/auth_token"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/AC874af45ec4a696d5d4dca07b0036e2bf/auth_token"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_chat_service_sid will be created
  + resource "aws_ssm_parameter" "twilio_chat_service_sid" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Chat service SID"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/staging/twilio/AC874af45ec4a696d5d4dca07b0036e2bf/chat_service_sid"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/AC874af45ec4a696d5d4dca07b0036e2bf/chat_service_sid"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/AC874af45ec4a696d5d4dca07b0036e2bf/chat_service_sid"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_chat_workflow_sid will be created
  + resource "aws_ssm_parameter" "twilio_chat_workflow_sid" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Chat Workflow SID"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/staging/twilio/AC874af45ec4a696d5d4dca07b0036e2bf/chat_workflow_sid"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/AC874af45ec4a696d5d4dca07b0036e2bf/chat_workflow_sid"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/AC874af45ec4a696d5d4dca07b0036e2bf/chat_workflow_sid"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_flex_proxy_service_sid will be created
  + resource "aws_ssm_parameter" "twilio_flex_proxy_service_sid" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Flex Proxy service SID"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/staging/twilio/AC874af45ec4a696d5d4dca07b0036e2bf/flex_proxy_service_sid"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/AC874af45ec4a696d5d4dca07b0036e2bf/flex_proxy_service_sid"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/AC874af45ec4a696d5d4dca07b0036e2bf/flex_proxy_service_sid"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_operating_info_key will be created
  + resource "aws_ssm_parameter" "twilio_operating_info_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Operating Info Key"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/staging/twilio/AC874af45ec4a696d5d4dca07b0036e2bf/operating_info_key"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/AC874af45ec4a696d5d4dca07b0036e2bf/operating_info_key"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/AC874af45ec4a696d5d4dca07b0036e2bf/operating_info_key"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_short_helpline_to_account_sid will be created
  + resource "aws_ssm_parameter" "twilio_short_helpline_to_account_sid" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - account SID by short helpline"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/staging/twilio/MW/account_sid"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/MW/account_sid"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/MW/account_sid"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_survey_workflow_sid will be created
  + resource "aws_ssm_parameter" "twilio_survey_workflow_sid" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Survey Workflow SID"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/staging/twilio/AC874af45ec4a696d5d4dca07b0036e2bf/survey_workflow_sid"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/AC874af45ec4a696d5d4dca07b0036e2bf/survey_workflow_sid"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/AC874af45ec4a696d5d4dca07b0036e2bf/survey_workflow_sid"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_sync_sid will be created
  + resource "aws_ssm_parameter" "twilio_sync_sid" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Sync service SID"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/staging/twilio/AC874af45ec4a696d5d4dca07b0036e2bf/sync_sid"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/AC874af45ec4a696d5d4dca07b0036e2bf/sync_sid"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/AC874af45ec4a696d5d4dca07b0036e2bf/sync_sid"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.aws.aws_ssm_parameter.twilio_workspace_sid will be created
  + resource "aws_ssm_parameter" "twilio_workspace_sid" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Twilio account - Workspace SID"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/staging/twilio/AC874af45ec4a696d5d4dca07b0036e2bf/workspace_sid"
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/AC874af45ec4a696d5d4dca07b0036e2bf/workspace_sid"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "Environment" = "staging"
          + "Name"        = "/staging/twilio/AC874af45ec4a696d5d4dca07b0036e2bf/workspace_sid"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.github[0].github_actions_secret.flex_twilio_account_sid will be created
  + resource "github_actions_secret" "flex_twilio_account_sid" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "flex-plugins"
      + secret_name     = "MW_STG_ACCOUNT_SID"
      + updated_at      = (known after apply)
    }

  # module.github[0].github_actions_secret.flex_twilio_auth_token will be created
  + resource "github_actions_secret" "flex_twilio_auth_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "flex-plugins"
      + secret_name     = "MW_STG_AUTH_TOKEN"
      + updated_at      = (known after apply)
    }

  # module.github[0].github_actions_secret.serverless_twilio_account_sid will be created
  + resource "github_actions_secret" "serverless_twilio_account_sid" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless"
      + secret_name     = "MW_STG_ACCOUNT_SID"
      + updated_at      = (known after apply)
    }

  # module.github[0].github_actions_secret.serverless_twilio_auth_token will be created
  + resource "github_actions_secret" "serverless_twilio_auth_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless"
      + secret_name     = "MW_STG_AUTH_TOKEN"
      + updated_at      = (known after apply)
    }

  # module.github[0].github_actions_secret.webchat_serverless_url will be created
  + resource "github_actions_secret" "webchat_serverless_url" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "webchat"
      + secret_name     = "MW_STG_SERVERLESS_URL"
      + updated_at      = (known after apply)
    }

  # module.hrmServiceIntegration.null_resource.hrm_static_api_key will be created
  + resource "null_resource" "hrm_static_api_key" {
      + id       = (known after apply)
      + triggers = {
          + "environment"       = "Staging"
          + "helpline"          = "Tithandizane"
          + "short_environment" = "STG"
          + "short_helpline"    = "MW"
        }
    }

  # module.serverless.data.external.service_environment_production will be read during apply
  # (config refers to values not yet known)
 <= data "external" "service_environment_production" {
      + id      = (known after apply)
      + program = [
          + "python3",
          + "../../serverless/default/getServerlessServiceEnvironmentData.py",
        ]
      + query   = {
          + "environment_sid"    = (known after apply)
          + "service_sid"        = "ZS19005295d6d012bfea9983de0ba3e6b8"
          + "twilio_account_sid" = (sensitive value)
          + "twilio_auth_token"  = (sensitive value)
        }
      + result  = (known after apply)
    }

  # module.serverless.twilio_serverless_services_environments_v1.dev must be replaced
-/+ resource "twilio_serverless_services_environments_v1" "dev" {
      ~ id            = "ZS19005295d6d012bfea9983de0ba3e6b8/ZE7a787f1358bc3666d61e2c3deaf237f2" -> (known after apply)
      ~ sid           = "ZE7a787f1358bc3666d61e2c3deaf237f2" -> (known after apply)
      ~ unique_name   = "dev-environment" -> "dev" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.serverless.twilio_serverless_services_environments_v1.production must be replaced
-/+ resource "twilio_serverless_services_environments_v1" "production" {
      ~ id            = "ZS19005295d6d012bfea9983de0ba3e6b8/ZEa0a7fc38616a1934a04b9e13c678df53" -> (known after apply)
      ~ sid           = "ZEa0a7fc38616a1934a04b9e13c678df53" -> (known after apply)
      ~ unique_name   = "production-environment" -> "production" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.services.null_resource.sync_api_key will be created
  + resource "null_resource" "sync_api_key" {
      + id       = (known after apply)
      + triggers = {
          + "environment"       = "Staging"
          + "helpline"          = "Tithandizane"
          + "short_environment" = "STG"
          + "short_helpline"    = "MW"
        }
    }

  # module.services.twilio_chat_services_v2.flex_chat_service will be updated in-place
  ~ resource "twilio_chat_services_v2" "flex_chat_service" {
      ~ friendly_name                              = "Flex Chat Service" -> "Flex Conversation Service"
        id                                         = "IS8925eda757a14ac294d16d040cf5d0c1"
        # (21 unchanged attributes hidden)
    }

  # module.services.twilio_sync_services_v1.shared_state_service will be updated in-place
  ~ resource "twilio_sync_services_v1" "shared_state_service" {
      ~ friendly_name                   = "Shared State Service " -> "Shared State Service"
        id                              = "IS28db2986c5bd186e4c4b7dd75f990719"
        # (6 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_task_queues_v1.task_queue["e2e_test"] will be created
  + resource "twilio_taskrouter_workspaces_task_queues_v1" "task_queue" {
      + assignment_activity_sid  = (known after apply)
      + friendly_name            = "E2E Test Queue"
      + id                       = (known after apply)
      + max_reserved_workers     = (known after apply)
      + reservation_activity_sid = (known after apply)
      + sid                      = (known after apply)
      + target_workers           = "email=='aselo-alerts+production@techmatters.org'"
      + task_order               = (known after apply)
      + workspace_sid            = "WS693819f2d6b9c9eb73964c4f4bf2ae2b"
    }

  # module.taskRouter.twilio_taskrouter_workspaces_v1.flex_task_assignment will be updated in-place
  ~ resource "twilio_taskrouter_workspaces_v1" "flex_task_assignment" {
      ~ event_callback_url     = "https://serverless-2780-production.twil.io/webhooks/taskrouterCallback" -> (known after apply)
      ~ events_filter          = "task.created,task.completed,task.canceled,task.deleted,task.system-deleted,task.wrapup,reservation.accepted,reservation.rejected,reservation.timeout,reservation.wrapup,task-queue.entered,workflow.timeout" -> "task.created,task.canceled,task.completed,task.deleted,task.wrapup,task-queue.entered,task.system-deleted,reservation.accepted,reservation.rejected,reservation.timeout,reservation.wrapup"
        id                     = "WS693819f2d6b9c9eb73964c4f4bf2ae2b"
        # (6 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.workflow["master"] will be updated in-place
  ~ resource "twilio_taskrouter_workspaces_workflows_v1" "workflow" {
      ~ configuration            = jsonencode(
            {
              - task_routing = {
                  - filters = [
                      - {
                          - expression           = "channelType==\"web\" OR isContactlessTask==true OR twilioNumber==\"messenger:103647528912458\""
                          - filter_friendly_name = "Tithandizane Helpline"
                          - targets              = [
                              - {
                                  - expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  - queue      = "WQ4a533333e740807e01d63a3422b5194a"
                                },
                            ]
                        },
                      - {
                          - expression           = "channelType==\"web\" OR twilioNumber==\"messenger:109935224940740\""
                          - filter_friendly_name = "Yoneco"
                          - targets              = [
                              - {
                                  - expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  - queue      = "WQd837dcc0c4b9fd9c25dc714747ae1933"
                                },
                            ]
                        },
                    ]
                }
            }
        ) -> (known after apply)
        id                       = "WS693819f2d6b9c9eb73964c4f4bf2ae2b/WW8c00b1d8c48e543377ca59b1bc4123fd"
        # (4 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.workflow["survey"] will be updated in-place
  ~ resource "twilio_taskrouter_workspaces_workflows_v1" "workflow" {
      ~ configuration            = jsonencode(
          ~ {
              ~ task_routing = {
                  ~ filters = [
                      ~ {
                          ~ filter_friendly_name = "Survey Filter" -> "CaptureChannel"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                }
            }
        )
      ~ friendly_name            = "Survey" -> "Survey Workflow"
        id                       = "WS693819f2d6b9c9eb73964c4f4bf2ae2b/WW2133612cdcbf019876de418f27f9d5c4"
        # (3 unchanged attributes hidden)
    }

Plan: 35 to add, 15 to change, 4 to destroy.

Changes to Outputs:
  ~ serverless_environment_production_sid = "ZEa0a7fc38616a1934a04b9e13c678df53" -> (known after apply)
  ~ serverless_url                        = "https://serverless-2780-production.twil.io" -> (known after apply)
  ~ task_router_master_workflow_sid       = "WW8c00b1d8c48e543377ca59b1bc4123fd" -> (known after apply)
  ~ task_router_workflow_sids             = {
      ~ master = "WW8c00b1d8c48e543377ca59b1bc4123fd" -> (known after apply)
      ~ survey = "WW2133612cdcbf019876de418f27f9d5c4" -> (known after apply)
    }

─────────────────────────────────────────────────────────────────────────────